const indeclinableNouns = [
    "какао",
    "манго",
    "кино",
    "метро",
    "бюро",
    "домино",
    "трюмо",
    "пальто",
    "танго",
    "бунгало",
    "вето",
    "авокадо",
    "дело",
    "сабо",
    "бордо",
    "евро",
    "эсперанто",
    "кашпо",
    "депо",
    "пианино",
    "кенгуру",
    "шоу",
    "рагу",
    "какаду",
    "зебу",
    "фрау",
    "конферансье",
    "шимпанзе",
    "колье",
    "резюме",
    "кашне",
    "атташе",
    "пенсне",
    "протеже",
    "суфле",
    "драже",
    "шоссе",
    "пюре",
    "купе",
    "фойе",
    "коммюнике",
    "кофе",
    "кафе",
    "жалюзи",
    "шасси",
    "такси",
    "алиби",
    "киви",
    "конфетти",
    "жюри",
    "иваси",
    "пенальти",
    "рефери",
    "регби",
    "кольраби",
    "спагетти",
    "бренди",
    "виски",
    "травести",
    "пони",
    "каноэ",
    "алоэ",
    "нэцкэ",
    "каратэ",
    "каланхоэ",
    "меню",
    "авеню",
    "дежавю",
    "инженю",
    "барбекю",
    "парвеню",
    "интервью",
    "боа",
    "бра",
    "фейхоа",
    "буржуа",
    "амплуа",
    "мисс",
    "миссис",
    "фрейлен",
];

const masculineExceptions = [
    "папа",
    "дядя",
    "дедушка",
    "мужчина",
    "кофе",
    "голубь",
    "лебедь",
    "январь",
    "февраль",
    "март",
    "апрель",
    "май",
    "июнь",
    "июль",
    "август",
    "сентябрь",
    "октябрь",
    "ноябрь",
    "декабрь",
    "червь",
    "гвоздь",
    "дождь",
    "вождь",
    "желудь",
    "медведь",
    "господь",
    "груздь",
    "ферзь",
    "витязь",
    "язь",
    "карась",
    "лосось",
    "зять",
    "тесть",
    "гость",
    "путь",
];

const feminineExceptions = [
    "подмастерье",
    "метель",
    "карусель",
    "тварь",
    "утварь",
    "гарь",
    "марь",
    "обитель",
    "канитель",
    "постель",
    "капитель",
    "матерь",
];

const neutralEndings = ["о", "е", "мя", "и", "у"];

const masculineEndings = ["б", "в", "д", "з", "л", "м", "н", "п", "ёнок", "онок", "тель", "арь", "ерь", "ырь", "ень"];

const feminineEndings = ["а", "я", "ия", "бь", "вь", "дь", "зь", "сь", "ть", "жь", "шь", "щь", "чь"];

const isEndsWith = (endings: string[], word: string) => {
    return endings.some((ending) => word.endsWith(ending));
};

export const defineGender = (word: string) => {
    if (indeclinableNouns.includes(word) || masculineExceptions.includes(word) || isEndsWith(masculineEndings, word)) {
        return "masculine";
    }
    if (feminineExceptions.includes(word) || isEndsWith(feminineEndings, word)) {
        return "feminine";
    }
    if (isEndsWith(neutralEndings, word)) {
        return "neutral";
    }
    return "masculine";
};
